-- phpMyAdmin SQL Dump
-- version 4.6.6
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Mar 15, 2019 at 03:48 AM
-- Server version: 5.7.17-log
-- PHP Version: 5.6.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `mytable`
--

-- --------------------------------------------------------

--
-- Table structure for table `advisors`
--

CREATE TABLE `advisors` (
  `Advisorsname` varchar(100) NOT NULL COMMENT 'ชื่ออาจารย์',
  `Teachercode` int(20) NOT NULL COMMENT 'รหัสอาจารย์'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `advisors`
--

INSERT INTO `advisors` (`Advisorsname`, `Teachercode`) VALUES
('อาจารย์ประกาย นาดี', 101),
('อาจารย์สุภัทรา เกิดเมฆ', 102),
('อาจารย์กีระชาติ สุขสุทธิ์', 103),
('ผู้ช่วยศาสตราจารย์วิทยา ศรีกุล', 104),
('ผู้ช่วยศาสตราจารย์พรภัสสร อ่อนเกิด', 105),
('อาจารย์ทิพา กองศรีมา', 106);

-- --------------------------------------------------------

--
-- Table structure for table `branch`
--

CREATE TABLE `branch` (
  `Branchname` varchar(100) NOT NULL COMMENT 'ชื่อสาขา',
  `Branchcode` int(20) NOT NULL COMMENT 'รหัสสาขา'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `branch`
--

INSERT INTO `branch` (`Branchname`, `Branchcode`) VALUES
('วิศวกรรมคอมพิวเตอร์', 1733);

-- --------------------------------------------------------

--
-- Table structure for table `course`
--

CREATE TABLE `course` (
  `Coursename` varchar(100) NOT NULL COMMENT 'ชื่อหลักสูตร',
  `Coursecode` int(20) NOT NULL COMMENT 'รหัสหลักสูตร'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `course`
--

INSERT INTO `course` (`Coursename`, `Coursecode`) VALUES
('ปกติ', 1733022),
('เทียบโอน', 1733023);

-- --------------------------------------------------------

--
-- Table structure for table `faculty`
--

CREATE TABLE `faculty` (
  `Facultyname` varchar(100) NOT NULL COMMENT 'ชื่อคณะ',
  `Facultycode` int(20) NOT NULL COMMENT 'รหัสคณะ'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `faculty`
--

INSERT INTO `faculty` (`Facultyname`, `Facultycode`) VALUES
('วิศวกรรมศาสตร์และสถาปัตยกรรมศาสตร์', 1700);

-- --------------------------------------------------------

--
-- Table structure for table `student`
--

CREATE TABLE `student` (
  `ID` varchar(20) NOT NULL COMMENT 'รหัสนักศึกษา',
  `Prefix` varchar(20) NOT NULL COMMENT 'คำนำหน้า',
  `FirstnameTH` varchar(100) NOT NULL COMMENT 'ชื่อจริง',
  `LastnameTH` varchar(100) NOT NULL COMMENT 'นามสุกล',
  `FirstnameEN` varchar(100) NOT NULL COMMENT 'ชื่อจิงภาษาอังกฤษ',
  `LastnameEN` varchar(100) NOT NULL COMMENT 'นามสกุลภาษาอังกฤษ',
  `Nickname` varchar(100) NOT NULL COMMENT 'ชื่อเล่น',
  `Idcard` varchar(20) NOT NULL COMMENT 'หมายเลขบัตรประชาชน',
  `Birthday` varchar(100) NOT NULL COMMENT 'วันเดือนปีเกิด',
  `Blood` varchar(5) NOT NULL COMMENT 'กรุ๊ปเลือด',
  `Cell` varchar(20) NOT NULL COMMENT 'เบอร์โทรศัพท์',
  `GraduationBranch` varchar(100) NOT NULL COMMENT 'สาขาที่จบมา',
  `GraduationDegree` varchar(100) NOT NULL COMMENT 'วุฒิการศึกษา',
  `GPA` decimal(5,0) NOT NULL COMMENT 'เกรดเฉลี่ย',
  `Schoolname` varchar(100) NOT NULL COMMENT 'สถาบันที่จบการศึกษา',
  `Housenumber` varchar(100) NOT NULL COMMENT 'บ้านเลขที่',
  `Subdistrict` varchar(100) NOT NULL COMMENT 'ตำบล',
  `District` varchar(100) NOT NULL COMMENT 'อำเภอ',
  `province` varchar(100) NOT NULL COMMENT 'จังหวัด',
  `Zipcode` int(10) NOT NULL COMMENT 'รหัสไปรษณีย์',
  `Coursecode` int(20) NOT NULL COMMENT 'รหัสหลักสูตร',
  `Groupcode` int(20) NOT NULL COMMENT 'รหัสกลุ่มเรียน',
  `Schoolcode` int(20) NOT NULL COMMENT 'รหัสสถาบัน',
  `Branchcode` int(20) NOT NULL COMMENT 'รหัสสาขา',
  `FacultyCode` int(20) NOT NULL COMMENT 'รหัสคณะ',
  `Subdistrictcode` int(20) NOT NULL COMMENT 'รหัสตำบล',
  `Districtcode` int(20) NOT NULL COMMENT 'รหัสอำเภอ',
  `Provincecode` int(20) NOT NULL COMMENT 'รหัสจังหวัด',
  `Teachercode` int(20) NOT NULL COMMENT 'รหัสอาจารย์',
  `AcademicYear` int(10) NOT NULL COMMENT 'ปีการศึกษา'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `student`
--

INSERT INTO `student` (`ID`, `Prefix`, `FirstnameTH`, `LastnameTH`, `FirstnameEN`, `LastnameEN`, `Nickname`, `Idcard`, `Birthday`, `Blood`, `Cell`, `GraduationBranch`, `GraduationDegree`, `GPA`, `Schoolname`, `Housenumber`, `Subdistrict`, `District`, `province`, `Zipcode`, `Coursecode`, `Groupcode`, `Schoolcode`, `Branchcode`, `FacultyCode`, `Subdistrictcode`, `Districtcode`, `Provincecode`, `Teachercode`, `AcademicYear`) VALUES
('59172110018-3', 'นาย', 'คุณานนต์', 'หนูไพล', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 104, 2559),
('59172110035-9', 'นางสาว', 'กนกวรรณ', 'สียา', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 104, 2559),
('59172110037-9', 'นาย', 'จิรภัทร ', 'ธรรมสอน', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 104, 2559),
('59172110058-4', 'นาย', 'อนุวัฒน์', 'ปะชาตรี', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 104, 2559),
('59172110097-6', 'นาย', 'ทรงพล', 'โยบสูงเนิน	', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 104, 2559),
('59172110122-0', 'นาย', 'กิตติกรณ์', 'บรรจงปรุ', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 104, 2559),
('59172110214-1', 'นาย', 'ยุทธศาสตร์', 'นอขุนทด', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 104, 2559),
('59172110223-9', 'นาย', 'ปกรณ์', 'ถาวรสันต์', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 104, 2559),
('59172110240-5', 'นาย', 'ธรณัส', 'หิรัญอร', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 104, 2559),
('59172110267-0', 'นาย', 'อดิศักดิ์', 'เขียงกระโทก', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 104, 2559),
('59172110269-0', 'นางสาว', 'ปรียา ', 'หฤทัยถาวร', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 104, 2559),
('59172110284-6', 'นาย', 'ศุภชัย', 'กาญจนมยูร', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 104, 2559),
('59172110304-2', 'นาย', 'ปรมัตถ์', 'แนบกระโทก', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 104, 2559),
('59172110315-0', 'นาย', 'สหรัฐ', 'สร้อยทอง', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 104, 2559),
('59172110336-6', 'นาย', 'พงศธร', 'มูลสาร', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 104, 2559),
('59172110365-9', 'นาย', 'ณฐนนท์', 'บุญสินธุ์', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 104, 2559),
('59172110376-7', 'นาย', 'สุพล', 'พวงจันทึก', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 104, 2559),
('59172110406-1', 'นาย', 'ศุภชัย', 'มิสา', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 104, 2559),
('59172110410-9', 'นาย', 'พิพัฒพงศ์', 'สุธรรมวิจิตร', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 104, 2559),
('59172110441-3', 'นางสาว', 'กาญจนา', 'วิ่งพิมาย', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 104, 2559),
('59172110525-6', 'นาย', 'ธีรพล ', 'ขอสินกลาง', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 104, 2559),
('59172110567-7', 'นาย', 'สฏฐนันท์', 'โพธิจักร', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 104, 2559),
('59172110593-1', 'นาย', 'ฉันทวุฒิ', 'รวมใหม่', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 104, 2559),
('59172110595-1', 'นาย', 'ภูรินทร์', 'ศิลา', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 104, 2559),
('59172310003-1', 'นาย', 'ธีรโชฒ', 'ศรีริ', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733023, 0, 0, 1733, 1700, 0, 0, 0, 101, 2559),
('59172310009-1', 'นาย', 'วรพล', 'อุไรพรรณ', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733023, 0, 0, 1733, 1700, 0, 0, 0, 101, 2559),
('59172310011-9', 'นาย', 'กาญจนราช ', 'เทศนศิลป์', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733023, 0, 0, 1733, 1700, 0, 0, 0, 101, 2559),
('59172310032-5', 'นาย', 'กฤษดา', 'คลายทุกข์', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733023, 0, 0, 1733, 1700, 0, 0, 0, 101, 2559),
('59172310033-5', 'นาย', 'นพศักดิ์', 'อมรสิน', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733023, 0, 0, 1733, 1700, 0, 0, 0, 101, 2559),
('59172310062-8', 'นาย', 'จักราวุธ', 'สุขมล', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733023, 0, 0, 1733, 1700, 0, 0, 0, 101, 2559),
('59172310063-8', 'นาย', 'สรศักดิ์', 'ลองจำนงค์', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733023, 0, 0, 1733, 1700, 0, 0, 0, 101, 2559),
('59172310088-4', 'นางสาว', 'จรินทร ', ' เกศสาลี', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733023, 0, 0, 1733, 1700, 0, 0, 0, 101, 2559),
('59172310154-9', 'นาย', 'วัชรพร', 'พิลาฤทธิ์', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733023, 0, 0, 1733, 1700, 0, 0, 0, 101, 2559),
('59172310165-7	', 'นาย', 'อนุพงศ์', 'หึกขุนทด', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733023, 0, 0, 1733, 1700, 0, 0, 0, 101, 2559),
('59172310175-5	', 'นาย', 'อรรคเดช', 'ชาติมนตรี', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733023, 0, 0, 1733, 1700, 0, 0, 0, 101, 2559),
('59172310178-5	', 'นาย', 'ณรงค์ศักดิ์', 'เพ่งพิศ', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733023, 0, 0, 1733, 1700, 0, 0, 0, 101, 2559),
('59172310184-3	', 'นาย', 'อนุชิต', 'สายศร', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733023, 0, 0, 1733, 1700, 0, 0, 0, 101, 2559),
('59172310193-1	', 'นางสาว', 'เจนจิรา', 'กวินชวนชิด', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733023, 0, 0, 1733, 1700, 0, 0, 0, 101, 2559),
('59172310202-9	', 'นาย', 'กรรชัย', 'ระยัน', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733023, 0, 0, 1733, 1700, 0, 0, 0, 101, 2559),
('59172310204-9	', 'นาย', 'กิตติภณ', 'รักษาคุณ', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733023, 0, 0, 1733, 1700, 0, 0, 0, 101, 2559),
('59172310219-7	', 'นาย', 'โชคอนันต์', 'ทรัพย์เลิศประภา', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733023, 0, 0, 1733, 1700, 0, 0, 0, 101, 2559),
('59172310230-3	', 'นาย', 'ชาญชนะ', 'สุวิชาเชิดชู', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733023, 0, 0, 1733, 1700, 0, 0, 0, 101, 2559),
('59172310311-6	', 'นาย', 'ธนภัทร', 'มณีเนตร', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733023, 0, 0, 1733, 1700, 0, 0, 0, 101, 2559),
('60142110244-3', 'นาย', 'สุภัคว์', 'จันทร์กล้า', 'Supuck', ' Junklar', 'ตะไคร้', '', '3/5/2542', 'A', '091-4614142', 'อิเล็กทรอนิกส์', 'มัธยมศึกษาชั้นปีที่6', '4', 'วิทยาลัยเทคนิคสุรินทร์', '2', 'ในมือง', 'เมือง', 'สุรินทร์', 32000, 1733022, 0, 413177, 1733, 1700, 320101, 3201, 32, 105, 2560),
('60172110013-1', 'นาย', 'กฤษณพงศ์', 'โพธิ์นอก', 'Kritsanapong ', ' Phonok', 'ฟิล์ม', '', '4/27/2542', 'O', '061-6989232', 'วิทย์-คณิต', 'มัธยมศึกษาชั้นปีที่6', '3', 'โรงเรียนราชสีมาวิทยาลัย', '60/2', 'ในเมือง', 'เมือง', 'นครราชสีมา', 30000, 1733022, 0, 413101, 1733, 1700, 300101, 3001, 30, 105, 2560),
('60172110117-0', 'นางสาว', 'สลิลทิพย์', 'พิมพ์ทองครบุรี', 'SALINTHIP', ' PHIMTHONGKHONBURI', 'บีม', '', '1/2/2542', 'O', '094-2726750', 'วิทย์-คณิต', 'มัธยมศึกษาชั้นปีที่6', '3', 'โรงเรียนบุญวัฒนา', '59', 'ครบุรีใต้', 'ครบุรี', 'นครราชสีมา', 30250, 1733022, 0, 413125, 1733, 1700, 300210, 3002, 30, 105, 2560),
('60172110118-0', 'นางสาว', 'สุพัตรา', 'จิตสม', 'SUPATTRA', '  CHITSOM', 'ตุ๊กตา', '', '9/20/2541', 'A', '061-0312282', 'วิทย์-คณิต', 'มัธยมศึกษาชั้นปีที่6', '3', 'โรงเรียนโชคชัยสามัคคี', '66', 'ด่านเกวียน', 'โชคชัย', 'นครราชสีมา', 30190, 1733022, 0, 413105, 1733, 1700, 300710, 3007, 30, 105, 2560),
('60172110119-0', 'นาย', 'ภานุวิชญ์', 'บุญพิมพ์', 'Panuwit', ' Boonpim', 'ดิว', '', '1/14/2541', 'O', '096-1209724', 'วิทย์-คณิต', 'มัธยมศึกษาชั้นปีที่6', '3', 'โรงเรียนมัธยมด่านขุนทด', '156', 'หนองบัวตะเกียด', 'ด่านขุนทด', 'นครราชสีมา', 30210, 1733022, 0, 413113, 1733, 1700, 300811, 3008, 30, 105, 2560),
('60172110142-4', 'นาย', 'ภาณุวิชญ์', 'กิตติรงค์', 'Phanuwit', ' Kittirong', 'บิ๊ก', '', '11/26/2541', 'B', '085-7667628', 'วิทย์-คณิต', 'มัธยมศึกษาชั้นปีที่6', '3', 'โรงเรียนสูงเนิน', '478', 'สูงเนิน', 'สูงเนิน', 'นครราชสีมา', 30170, 1733022, 0, 413199, 1733, 1700, 301801, 3018, 30, 105, 2560),
('60172110155-1', 'นางสาว', 'กุลปริยา', 'พูนจันอัด', 'KOONPRIYA', '   POONJANAD', 'แบม', '', '4/11/2541', 'B ', '098-4873745', 'วิทย์-คณิต', 'มัธยมศึกษาชั้นปีที่6', '3', 'โรงเรียนอุบลรัตนราชกัญญาราชวิทยาลัยนครราชสีมา', '30', 'สีมุม', 'เมือง', 'นครราชสีมา', 30000, 1733022, 0, 413105, 1733, 1700, 300121, 3001, 30, 105, 2560),
('60172110179-7', 'นาย', 'วีรเชษฐ์', 'สารสำคัญ', 'Weerachet', '  Sarnsamkhan', 'โก้', '', '1/14/2542', 'A', '094-5373327', 'วิทย์-คณิต', 'มัธยมศึกษาชั้นปีที่6', '3', 'โรงเรียนพิมายวิทยา', '17', 'นิคม', 'พิมาย', 'นครราชสีมา', 30110, 1733022, 0, 413116, 1733, 1700, 301508, 3015, 30, 105, 2560),
('60172110224-7', 'นางสาว', 'ศิริวิริยา', 'หมื่นฤทธิ์', 'Siriwiriya', ' Muenrit', 'Pay', '', '7/22/2541', 'B', '082-2027741', 'วิทย์-คณิต', 'มัธยมศึกษาชั้นปีที่6', '3', 'โรงเรียนหนองกี่พิทยาคม', '132', 'สุขไพบูลย์', 'เสิงสาง', 'นครราชสีมา', 30330, 1733022, 0, 413126, 1733, 1700, 300305, 3003, 30, 105, 2560),
('60172110320-6', 'นาย', 'ภัคพล', 'ศิริพจน์', 'Phakapon', ' Siriphot', 'เซฟ', '', '6/17/2541', 'O', '062-5730515', 'วิทย์-คณิต', 'มัธยมศึกษาชั้นปีที่6', '3', 'โรงเรียนสีคิ้วสวัสดิ์ผดุงวิทยา', '75', 'มิตรภาพ', 'สีคิ้ว', 'นครราชสีมา', 30140, 1733022, 0, 413102, 1733, 1700, 302009, 3020, 30, 105, 2560),
('60172110375-5', 'นาย', 'กรรชัย', 'อยู่ศิริบูรณ์', 'KANCHAI ', ' YOOSIRIBOON', 'เจมส์', '', '1/11/2542', 'O', '062-4985831', 'วิทย์-คณิต', 'มัธยมศึกษาชั้นปีที่6', '3', 'โรงเรียนเมืองพลับพลาพิทยาคม', '19/1', 'หลุ่งตะเคียน', 'ห้วยแถลง', 'นครราชสีมา', 30240, 1733022, 0, 413110, 1733, 1700, 301604, 3016, 30, 105, 2560),
('60172110379-5', 'นาย', 'อดิเรก', 'โพธิ์ชัย', 'Adirak', ' Phochai', 'Bes', '', '5/1/2541', 'AB', '091-7023973', 'วิทย์-คณิต', 'มัธยมศึกษาชั้นปีที่6', '2', 'โรงเรียนห้วยแถลงพิทยาคม', '43', 'กงรถ', 'ห้วยแถลง', 'นครราชสีมา', 30240, 1733022, 0, 413124, 1733, 1700, 301607, 3016, 30, 105, 2560),
('60172110405-9', 'นาย', 'โยธิน', 'ช่องผักแว่น', 'Yothin ', 'Chongpukwan', 'โย', '', '11/24/2541', 'O', '093-5538303', 'วิทย์-คณิต', 'มัธยมศึกษาชั้นปีที่6', '3', 'โรงเรียนโชคชัยสามัคคี', '51/2', 'พลับพลา', 'โชคชัย', 'นครราชสีมา', 30190, 1733022, 0, 413105, 1733, 1700, 300702, 3007, 30, 105, 2560),
('60172110409-9', 'นาย', 'จีรวัฒน์', 'แทนไธสง', 'Jeerawat', ' Thanthaisong', 'วัต', '', '10/18/2541', 'O', '092-9068850', 'วิทย์-คณิต', 'มัธยมศึกษาชั้นปีที่6', '3', 'โรงเรียนเมืองพลับพลาพิทยาคม', '187', 'เมืองพลับพลา', 'ห้วยแถลง', 'นครราชสีมา', 30240, 1733022, 0, 413122, 1733, 1700, 301603, 3016, 30, 105, 2560),
('60172110443-1', 'นาย', 'ชัชวาล', 'น้อมพุดซา', 'chatchawan', ' nomphutsa', 'ที', '', '12/29/2541', 'O', '086-4612872', 'วิทย์-คณิต', 'มัธยมศึกษาชั้นปีที่6', '2', 'โรงเรียนพระทองคำวิทยา', '211', 'สระพระ', 'พระทองคำ', 'นครราชสีมา', 30220, 1733022, 0, 413110, 1733, 1700, 302801, 3028, 30, 105, 2560),
('60172110458-8', 'นาย', 'จิรพันธ์', 'ไพโรจน์วิทยาภรณ์', 'Jirapan', ' Pairochvittayaporn', 'เมฆ', '', '3/10/2541', 'O', '093-0782097', 'วิทย์-คณิต', 'มัธยมศึกษาชั้นปีที่6', '3', 'โรงเรียนบุญวัฒนา', '134', 'บ้านโพธิ์', 'เมือง', 'นครราชสีมา', 30000, 1733022, 0, 413125, 1733, 1700, 300115, 3001, 30, 105, 2560),
('60172110466-6', 'นางสาว', 'อรทัย', 'ประมังคะตา', 'Orathai', ' Pramangkata', 'แอ๋ม', '', '9/21/2541', 'O', '063-7864384', 'วิทย์-คณิต', 'มัธยมศึกษาชั้นปีที่6', '3', 'โรงเรียนหนองหว้าพิทยาสรรค์', '4', 'หนองหว้า', 'บัวลาย', 'นครราชสีมา', 30120, 1733022, 0, 413144, 1733, 1700, 303004, 3030, 30, 105, 2560),
('60172110487-2', 'นาย', 'ฐิติวัฒน์', 'เรืองศรี', 'Thitiwat', '  Ruengsri', 'อาฟ', '', '4/25/2542', 'B', '090-2957794', ' อิเล็กทรอนิกส์', 'มัธยมศึกษาชั้นปีที่6', '3', 'วิทยาลัยเทคนิคนครราชสีมา', '144/242', 'ไชยมงคล', 'เมือง', 'นครราชสีมา', 30000, 1733022, 0, 413165, 1733, 1700, 300118, 3001, 30, 105, 2560),
('60172110492-0', 'นาย', 'คมชาญ ', 'บุญการกิจ', 'komchan', ' boonkankid', 'เบนซ์', '', '11/6/2541', 'O', '094-5632237', 'วิทย์-คณิต', 'มัธยมศึกษาชั้นปีที่6', '2', 'โรงเรียนบุญเหลือวิทยานุสรณ์', '828/124', 'จอหอ', 'เมือง ', 'นครราชสีมา', 30310, 1733022, 0, 413170, 1733, 1700, 300116, 3001, 30, 105, 2560),
('60172110500-8', 'นางสาว', 'กัญจนพร', 'แสนเจียม', 'Kanjanapon', ' Saenjeam', 'ขิง', '', '8/27/2541', 'AB', '096-9036466', 'วิทย์-คณิต', 'มัธยมศึกษาชั้นปีที่6', '3', 'โรงเรียนประทาย', '6', 'ประทาย', 'ประทาย', 'นครราชสีมา', 30180, 1733022, 0, 413123, 1733, 1700, 301301, 3013, 30, 105, 2560),
('60172110502-8', 'นาย', 'ชัยธวัช', 'น้อมพุดซา', 'chaitawat', ' Nomphutsa', 'โอ', '', '12/29/2541', 'O', '083-9348581', 'วิทย์-คณิต', 'มัธยมศึกษาชั้นปีที่6', '3', 'โรงเรียนพระทองคำวิทยา', '211', 'สระพระ', 'พระทองคำ', 'นครราชสีมา', 30220, 1733022, 0, 413127, 1733, 1700, 302801, 3028, 30, 105, 2560),
('60172110595-9', 'นาย', 'บุริศร์', 'อินติยะ', 'Boorit', ' Intiya', 'ป้อ', '', '4/30/2540', 'O', '061-0577872', 'วิทย์-คณิต', 'มัธยมศึกษาชั้นปีที่6', '2', 'โรงเรียนสีคิ้วสัวสดิ์\"ผดุงวิทยา\"', '25', 'บ้านหัน', 'สีคิ้ว', 'นครราชสีมา', 30140, 1733022, 0, 413120, 1733, 1700, 302002, 3020, 30, 105, 2560),
('60172310006-9', 'นาย', 'ณัฐสิทธ์', 'ผัดตุ่น', 'NUTTACIT', 'PHATTUN', 'อ๊อฟ', '163020006407-2', '12/4/2539', 'O', '088-2069530', 'อิเล็กทรอนิกส์', 'ปวส', '3', 'วิทยาลัยเทคนิคระยอง', '30/132', 'เนินพระ', 'เมือง', 'ระยอง', 21150, 1733023, 0, 2675, 1733, 1700, 210109, 2101, 21, 102, 2560),
('60172310022-5', 'นาย', 'เกษม', 'พาพุทธ', 'GASEM', 'PAPUT', 'นาว', '139040003523-1', '1/26/2539', 'O', '098-6479971', 'เทคนิคคอมพิวเตอร์', 'ปวส', '3', 'วิทยาลัยเทคนิคอุดรธานี', '134', 'นากอก', 'ศรีบุญเรือง', 'หนองบัวลำภู', 39180, 1733023, 0, 2176, 1733, 1700, 390405, 3904, 36, 102, 2560),
('60172310078-4', 'นาย', 'พีรศรี', 'ศรีมะเริง', 'PEERASRI', 'SRIMAROENG', 'ดัช', '130990084149-8', '9/18/2535', 'A', '080-051259', 'เทคโนโลยีคอมพิวเตอร์ฮาร์ดแวร์', 'ปวส', '3', 'วิทยาลัยเทคโนโลยีช่างกลพาณิชยการนครราชสีมา', '118', 'บ้านเกาะ', 'เมือง', 'นครราชสีมา', 30000, 1733023, 0, 2238, 1733, 1700, 300112, 3001, 30, 102, 2560),
('60172310101-8', 'นางสาว', 'มุกรินทร์', 'ชูกลิ่น', 'MOOKARIN', 'CHOOKLIN', 'มุก', '134990081596-9', '11/5/2539', 'B', '085-3127765', 'เทคโนโลยีคอมพิวเตอร์', 'ปวส', '4', 'วิทยาลัยเทคนิคอุบลราชธานี', '20', 'ขี้เหล็ก', 'เมือง', 'อุบลราชธานี', 34000, 1733023, 0, 301, 1733, 1700, 340119, 3401, 34, 102, 2560),
('60172310102-8', 'นาย', 'ศรายุทธ', 'ไกรษร', 'SARAYUTH ', 'KRISOR', 'อาม', '130990138380-9', '2/13/2540', 'B', '087-2605597', 'ไฟฟ้ากำลัง', 'ปวส', '3', 'วิทยาลัยเทคโนโลยีช่างกลพาณิชยการนครราชสีมา', '50', 'ท่าลาดขาว', 'โชคชัย', 'นครราชสีมา', 30190, 1733023, 0, 2238, 1733, 1700, 300705, 3007, 30, 102, 2560),
('60172310128-4', 'นางสาว', 'รัตติกา', 'น้อยเนาลา', 'RATTIKA', 'NOYNOALA', 'บี๋', '130960006675-8', '7/4/2539', 'B', '099-6950849', 'เทคโนโลยีคอมพิวเตอร์ฮาร์ดแวร์', 'ปวส', '4', 'วิทยาลัยเทคโนโลยีช่างกลพาณิชยการนครราชสีมา', '619/64', 'ด่านขุนทด', 'ด่านขุนทด', 'นครราชสีมา', 30210, 1733023, 0, 2238, 1733, 1700, 300802, 3008, 30, 102, 2560),
('60172310129-4', 'นางสาว', 'สุมิลตา', 'สิทธิ์สันเทียะ', 'SUMINTA ', 'SITSANTHIA', 'มิน', '130090018007-8', '2/11/2540', 'O', '094-8947774', 'เทคโนโลยีคอมพิวเตอร์ฮาร์ดแวร์', 'ปวส', '4', 'วิทยาลัยเทคโนโลยีช่างกลพาณิชยการนครราชสีมา', '252', 'โนนไทย', 'โนนไทย', 'นครราชสีมา', 30220, 1733023, 0, 2238, 1733, 1700, 300901, 3009, 30, 102, 2560),
('60172310130-2', 'นางสาว', 'สุริวิภา', 'ปั่นสันเทียะ', 'SURIVIPA', 'PANSANTHIA', 'หมิว', '130990133866-8', '10/29/2539', '-', '064-6207620', 'อุตสาหกรรมคอมพิวเตอร์', 'ปวส', '3', 'วิทยาลัยเทคโนโลยีช่างกลพาณิชยการนครราชสีมา', '17', 'พุดซา', 'เมือง', 'นครราชสีมา', 30000, 1733023, 0, 2238, 1733, 1700, 300114, 3001, 30, 102, 2560),
('60172310131-2', 'นาย', 'จอมพล', 'กระจ่างโพธิ์', 'JOMPON ', 'KAJANGPHO', 'โจ๊ค', '130990247520-1', '6/21/2540', 'O', '065-2510615', 'คอมพิวเตอร์', 'ปวส', '3', 'วิทยาลัยเทคโนโลยีช่างกลพาณิชยการนครราชสีมา', '9', 'บ้านโพธิ์', 'เมือง', 'นครราชสีมา', 30310, 1733023, 0, 2238, 1733, 1700, 300115, 3001, 30, 102, 2560),
('60172310133-2', 'นาย', 'วันชัย', 'รัตนรักษ์', 'WANCHAI ', 'RATTANARAK', 'ต้าร์', '130990139377-4', '3/20/2540', 'A', '085-4685125', 'เทคโนโลยีคอมพิวเตอร์ฮาร์ดแวร์', 'ปวส', '4', 'วิทยาลัยเทคโนโลยีช่างกลพาณิชยการนครราชสีมา', '472', 'บ้านเกาะ', 'เมือง', 'นครราชสีมา', 30000, 1733023, 0, 2238, 1733, 1700, 300112, 3001, 30, 102, 2560),
('60172310185-1', 'นาย', 'จารุกิต ', 'บุญจันทร์', 'JARUKIT ', 'BUNCHAN', 'บิว', '185990018562-6', '1/12/2540', 'A ', '093-4708848', 'คอมพิวเตอร์', 'ปวส', '3', 'วิทยาลัยเทคนิคนครราชสีมา', '126', 'นกออก', 'ปักธงชัย', 'นคราชสีมา', 30150, 1733023, 0, 1013, 1733, 1700, 301406, 3014, 30, 102, 2560),
('60172310194-9', 'นาย', 'พิชญากร', 'ศรีเนารัตน์', 'PHITCHAYAKARN ', 'SRINAWARAT', 'อาร์ม', '130990095135-8', '7/25/2536', 'B', '-', 'คอมพิวเตอร์', 'ปวส', '3', 'วิทยาลัยเทคโนโลยีช่างกลพาณิชยการนครราชสีมา', '36', 'มะค่า', 'โนนไทย', 'นครราชสีมา', 30220, 1733023, 0, 2238, 1733, 1700, 300914, 3009, 30, 102, 2560),
('60172310202-7', 'นาย', 'พรราชฤทธิ์', 'โพธิ์กลิ่น', 'PORNRACHARIT', 'POKLIN', 'เชียร์', '110200268748-9', '12/12/2539', 'AB', '093-5757853', 'เทคนิคคอมพิวเตอร์', 'ปวส', '3', 'วิทยาลัยเทคนิคนครราชสีมา', '70/687', 'ในเมือง', 'พิมาย', 'นครราชสีมา', 30110, 1733023, 0, 1013, 1733, 1700, 301501, 3015, 30, 102, 2560),
('60172310215-5', 'นาย', 'เมธา ', 'ประทุมภา', 'META ', 'PRATUMPA', 'ทอย', '119990058815-8', '2/18/2540', 'B', '081-9470365', 'เทคโนโลยีสารสนเทศ', 'ปวส', '3', 'วิทยาลัยเทคนิคสระบุรี', '29/194', 'โคกสว่าง', 'เมือง', 'สระบุรี', 18000, 1733023, 0, 625, 1733, 1700, 190107, 1901, 19, 102, 2560),
('60172310223-3', 'นาย', 'ปฏิภาณ', 'วงศ์จันทร์', 'PATIPAN', 'WONGCHAN', 'ไอซ์', '111950000055-2', '4/9/2540', 'B', '087-2515654', 'อิเล็กทรอนิกส์', 'ปวส', '3', 'วิทยาลัยเทคนิคนครราชสีมา', '236', 'ตลาด', 'เมือง', 'นครราชสีมา', 30310, 1733023, 0, 1013, 1733, 1700, 300122, 3001, 30, 102, 2560),
('60172310256-6', 'นาย', 'จตุพร', 'เหรียญทอง', 'JATAPORN ', 'RIANTONG', 'เต้', '133080025084-8', '3/1/2539', 'B', '094-0450848', 'เทคโนโลยีคอมพิวเตอร์', 'ปวส', '4', 'วิทยาลัยเทคนิคศรีสะเกษ', '358', 'ไพร', 'ขุนหาญ', 'ศรีสะเกษ', 33150, 1733023, 0, 712, 1733, 1700, 330601, 3306, 33, 102, 2560),
('60172310291-8', 'นางสาว', 'ศศิประภา', 'บุญชู', 'SASIPRAPA', 'BOONCHOO', 'มุก', '132120009178-2', '5/27/2537', 'O', '-', 'เทคโนโลยีสารสนเทศ', 'ปวส', '2', 'วิทยาลัยเทคนิคระยอง', '123', 'กระออม', 'สำโรงทาบ', 'สุรินทร์', 32170, 1733023, 0, 2675, 1733, 1700, 321203, 3212, 32, 102, 2560),
('60172310305-6', 'นาย', 'นนทวัฒน์', 'ป้อมสนาม', 'NONTAWAT', 'POMSANAM', 'นนท์', '130990133381-0', '10/21/2539', 'O', '082-6721057', 'อิเล็กทรอนิกส์อุตสาหกรรรม', 'ปวส', '3', 'วิทยาลัยเทคนิคราชบุรี', '226', 'หนองกระทุ่ม', 'เมือง', 'นครราชสีมา', 30000, 1733023, 0, 4057, 1733, 1700, 700804, 3001, 30, 102, 2560),
('60172310309-6', 'นาย', 'คมอิทธิเบศ', 'แมบจันทึก', 'KOMITTIBATE', 'MAEBJANTHUK', 'เบศ', '130990110055-6', '12/3/2537', 'B', '062-6178794', 'เทคโนโลยีคอมพิวเตอร์ฮาร์ดแวร์', 'ปวส', '2', 'วิทยาลัยเทคโนโลยีช่างกลพาณิชยการนครราชสีมา', '379', 'เมือง', 'เมือง', 'นครราชสีมา', 30000, 1733023, 0, 2238, 1733, 1700, 300101, 3001, 30, 102, 2560),
('60172310311-4', 'นาย', 'เนติพงศ์', 'สุนันทิพร์', 'NAETIPHONG ', 'SUNANTIP', 'เจฟ', '145990052167-1', '12/19/2538', 'B', '093-7417463', 'อิเล็กทรอนิกส์', 'ปวส', '4', 'วิทยาลัยเทคนิคร้อยเอ็ด', '9', 'หนองแวงตง', 'ศรีมมเศษ', 'ร้อยเอ็ด', 45000, 1733023, 0, 2532, 1733, 1700, 451607, 4516, 45, 102, 2560),
('60172310318-4', 'นาย', 'พิเชษฐ์', 'สัตนาโค', 'PRCHET', 'SATTANAKO', 'บอล', '130970017856-6', '10/18/2539', 'B', '099-8522995', 'เทคโนโลยีสารสนเทศ', 'ปวส', '4', 'วิทยาลัยเทคนิคขอนแก่น', '39/1', 'ขุนทอง', 'บัวใหญ่', 'นครราชสีมา', 30120, 1733023, 0, 1807, 1733, 1700, 301220, 3012, 30, 102, 2560),
('60172310321-2', 'นาย', 'ธนวัฒช์', 'พยนต์เลิศ', 'TANAWAT ', 'PHAYONLERT', 'บอย', '130990138490-2', '2/16/2540', 'B', '062-1648809', 'อิเล็กทรอนิกส์', 'ปวส', '3', 'วิทยาลัยเทคนิคนครราชสีมา', '624', 'ในเมือง', 'เมือง', 'นครราชสีมา', 30000, 1733023, 0, 1013, 1733, 1700, 300101, 3001, 30, 102, 2560),
('60172310322-2', 'นางสาว', 'วีร์นันทิยา', 'ทรัพย์มาก', 'VEENUNTIYA', 'SABMAK', 'ฟิล์ม', '130090017033-1', '9/6/2538', 'O', '064-2133641', 'โทรคมนาคม', 'ปวส', '3', 'วิทยาลัยสารพัดช่างนครราชสีมา', '97', 'สายออ', 'โนนไทย', 'นครราชสีมา', 30220, 1733023, 0, 1102, 1733, 1700, 300908, 3009, 30, 102, 2560),
('60172310325-2', 'นาย', 'วันชัย', 'สีหะวงษ์', 'WANCHAI ', 'SEEHAWONG', 'จิ๋ว', '130980129367-1', '3/21/2540', 'A', '061-0746879', 'อิเล็กทรอนิกส์', 'ปวส', '4', 'วิทยาลัยเทคนิคสระบุรี', '19', 'หนองสาหร่าย', 'ปากช่อง', 'นครราชสีมา', 30130, 1733023, 0, 625, 1733, 1700, 302106, 3021, 30, 102, 2560),
('60172310353-5', 'นางสาว', 'เสาวคนธ์', 'ผลพิมาย', 'SAOWAKHON', 'PHONPHIMAI', 'อาย', '130150025411-3', '10/4/2539', 'O', '095-6744855', 'ไฟฟ้ากำลัง', 'ปวส', '2', 'วิทยาลัยเทคนิคนครราชสีมา', '369', 'ในเมือง', 'เมือง', 'นครราชสีมา', 30000, 1733023, 0, 1013, 1733, 1700, 300101, 3001, 30, 102, 2560),
('61172110002-1', 'นาย', 'ณัฐพงษ์ ', 'พุฒหล่า', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 106, 2561),
('61172110018-9', 'นาย', 'ฤกษ์ชัย ', 'ดีนวนพะเนาว์', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 106, 2561),
('61172110019-9', 'นางสาว', 'ศิริพร', 'ชุบกระโทก', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 106, 2561),
('61172110052-0', 'นางสาว', 'พัฒนวรรณ ', 'วัดอิ่ม', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 106, 2561),
('61172110059-0', 'นาย', 'ณัฐวัฒน์ ', 'สุวรรณดวง', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 106, 2561),
('61172110062-8', 'นางสาว', 'พัชริดา ', 'ค่ากระโทก', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 106, 2561),
('61172110077-6', 'นาย', 'ธีรศักดิ์ ', 'ปะสาระวัน', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 106, 2561),
('61172110078-6', 'นาย', 'ดุลยกิจ ', 'พรมชาติ', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 106, 2561),
('61172110082-4', 'นางสาว', 'ธิดารัตน์ ', 'ชอนขุนทด', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 106, 2561),
('61172110088-4', 'นาย', 'ธีระพงษ์ ', 'จันทร์ขุนทด', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 106, 2561),
('61172110102-0', 'นาย', 'นันทิพัฒน์ ', 'นิพรรัมย์', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 106, 2561),
('61172110112-8', 'นาย', 'บุญนิธิ ', 'อุทธาทอง', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 106, 2561),
('61172110173-5', 'นาย', 'รัตนพงษ์ ', 'เรืองเจริญ', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 106, 2561),
('61172110187-3', 'นาย', 'หรรษวัต ', 'บุญกอง', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 106, 2561),
('61172110211-7', 'นางสาว', 'นิษา ', 'บัวหลวง', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 106, 2561),
('61172110226-5', 'นางสาว', 'มัณฑนา ', 'คำตัน', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 106, 2561),
('61172110233-3', 'นาย', 'จิรายุทธ ', 'จูพัฒนกุล', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 106, 2561),
('61172110271-4', 'นาย', 'ศุภณัฐ', ' สุริยนต์', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 106, 2561),
('61172110272-4', 'นาย', 'ทักษ์ดนัย ', 'แต่งผิว', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 106, 2561),
('61172110288-2', 'นางสาว', 'สุพัตรา ', 'โสชาลี', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 106, 2561),
('61172110314-6', 'นางสาว', 'สุณิตา ', 'นาใจดี', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 106, 2561),
('61172110319-6', 'นาย', 'รัชพล ', 'รุยทอง', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 106, 2561),
('61172110343-0', 'นาย', 'กฤตพัฒน์ ', 'จำปาโพธิ์', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 106, 2561),
('61172110414-5', 'นาย', 'นนท์ปวิธ ', 'สุขสมแดน', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 106, 2561),
('61172110419-5', 'นางสาว', 'ศศิกานต์ ', 'วานนท์', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 106, 2561),
('61172110421-3', 'นาย', 'ณัฐพล ', 'นานา', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733022, 0, 0, 1733, 1700, 0, 0, 0, 106, 2561),
('61172310019-5', 'นาย', 'ศุภชัย', 'เดชทะสร', 'SUPHACHAI', 'DETTHASORN', 'เปรียว', '142990030949-3', '12/12/2540', 'O', '085-9256728', 'เทคโนโลยีคอมพิวเตอร์', 'ปวส', '4', 'วิทยาลัยเทคนิคเลย', '25', 'โคกขมิ้น', 'ว้อสะพุง', 'เลย', 42130, 1733023, 0, 1842, 1733, 1700, 420912, 4209, 42, 103, 2561),
('61172310021-3', 'นาย', 'อภิชัย', 'รักษาถิ่น', 'APICHAI', 'RAKSATIN', 'บูม', '110070941888-6', '11/3/2539', 'O', '064-8013394', 'อิเล็กทรอนิกส์', 'ปวส', '3', 'วิทยาลัยเทคนิคนครราชสีมา', '231/257', 'โพธิ์กลาง', 'เมือง', 'นครราชสีมา', 3000, 1733023, 0, 1013, 1733, 1700, 300102, 3001, 30, 103, 2561),
('61172310025-3', 'นางสาว', 'กนกอร ', 'หอยตะคุ', 'KANAKORN', 'HOITAKHU', 'ฝ้าย', '130990129768-6', '7/9/2539', 'A', '061-1630391', 'อิเล็กทรอนิกส์', 'ปวส', '4', 'วิทยาลัยเทคนิคนครราชสีมา', '108', 'ตะคุ', 'ปักธงชัย', 'นครราชสีมา', 30150, 1733023, 0, 1013, 1733, 1700, 301402, 3014, 30, 103, 2561),
('61172310031-1', 'นาย', 'ฐานวัฒน์', 'วงศ์สมพิศ', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733023, 0, 0, 1733, 1700, 0, 0, 0, 103, 2561),
('61172310041-9', 'นาย', 'กษิดิศ', 'สังฆมานนท์', 'KASIDIT', 'SUNGKAMANONT', 'ซัน', '130990250927-5', '10/11/2540', 'O', '097-3231135', 'เทคโนโลยีคอมพิวเตอร์', 'ปวส', '3', 'วิทยาลัยเทคนิคนครราชสีมา', '62/2', 'เมือง', 'เมือง', 'นครราชสีมา', 3000, 1733023, 0, 1013, 1733, 1700, 300101, 3001, 30, 103, 2561),
('61172310057-6', 'นาย', 'ปฏิภาณ', 'ลอยศักดิ์', 'PATIPHAN', 'LOYSAK', 'บิ๊ก', '110990118849-5', '7/4/2540', 'A', '097-0657158', 'คอมพิวเตอร์อุตสาหกรรม', 'ปวส', '3', 'มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน', '9', 'เมือง', 'เมือง', 'นครราชสีมา', 3000, 1733023, 0, 1013, 1733, 1700, 300101, 3001, 30, 103, 2561),
('61172310061-4', 'นาย', 'สุชาติ ', 'เคหะบุตร', 'SUCHAT', 'KHEHABUT', 'มอร์ธ', '142990029351-1', '5/22/2540', 'B', '-', 'เทคโนโลยีคอมพิวเตอร์', 'ปวส', '4', 'วิทยาลัยเทคนิคเลย', '33', 'ทรายขาว', 'วังสะพุง', 'เลย', 42130, 1733023, 0, 1842, 1733, 1700, 420902, 4209, 42, 103, 2561),
('61172310081-0', 'นาย', 'กรินทร์', 'สุวรรณดวง', 'KARIN', 'SUWANDUNG', 'ลัคกี้', '110050124067-2', '9/24/2538', 'AB', '098-2478132', 'อิเล็กทรอนิคคอมพิวเตอร์', 'ปวส', '3', 'วิทยาลัยเทคนิคนครราชสีมา', '777/774', 'หนองบัวศาลา', 'เมือง', 'นครราชสีมา', 30000, 1733023, 0, 1013, 1733, 1700, 300119, 3001, 30, 103, 2561),
('61172310084-0', 'นาย', 'พัฒนพงษ์', 'ทาวะรมย์', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733023, 0, 0, 1733, 1700, 0, 0, 0, 103, 2561),
('61172310096-8', 'นาย', 'ชัยชนะ', 'เบกเกอร์', 'CHAICHANA', 'BECKER', 'คิม', '146990029895-5', '1/28/2538', 'A', '088-9259583', 'เทคนิคคอมพิวเตอร์', 'ปวส', '4', 'วิทยาลัยเทคโนโลยีช่างกลพาณิชยการนครราชสีมา', '256', 'หัวทะเล', 'เมือง', 'นครราชสีมา', 30000, 1733023, 0, 2238, 1733, 1700, 300111, 3001, 30, 103, 2561),
('61172310098-8', 'นาย', 'ชนิศร์ ', 'ประชารักษ์', 'CHANIT', 'PRACHARAK', 'โกโก้', '130990256020-7', '3/31/2541', 'A', '083-366842', 'แมคคาทรอนิค', 'ปวส', '3', 'วิทยาลัยเทคนิคนครราชสีมา', '687', 'เมือง', 'เมือง', 'นครราชสีมา', 30000, 1733023, 0, 1013, 1733, 1700, 300101, 3001, 30, 103, 2561),
('61172310101-6', 'นาย', 'ธีรวุฒิ', ' ขันพันธ์', 'THIRAWUT', 'KHANPAN', 'อู๋', '133100027585-5', '6/29/2540', 'B', '098-6203603', 'อิเล็กทรอนิกส์', 'ปวส', '3', 'วิทยาลัยเทคนิคศรีสะเกษ', '53', 'หนองไฮ', 'อุทุมพรพิสัย', 'ศรีสะเกษ', 33120, 1733023, 0, 712, 1733, 1700, 330119, 3301, 33, 103, 2561),
('61172310133-0', 'นาย', 'ไชยนุวัติ', 'สิงหประชา', 'CHAINUWAT', 'SINHAPACHA', 'ก๊อต', '110070242990-0', '11/25/2539', 'O', '090-8325108', 'เทคนิคคอมพิวเตอร์', 'ปวส', '3', 'วิทยาลัยเทคโนโลยีช่างกลพาณิชยการนครราชสีมา', '148', 'เมือง', 'เมือง', 'นครราชสีมา', 30000, 1733023, 0, 2238, 1733, 1700, 300101, 3001, 30, 103, 2561),
('61172310156-5', 'นาย', 'กิตติพงษ์', 'ปลิงกระโทก', 'KITTIPONG', 'PLINGKATOK', 'เต้', '1309901207216-1', '6/29/2539', 'O', '084-8285681', 'ไฟฟ้ากำลัง', 'ปวส', '3', 'วิทยาลัยเทคนิคนครราชสีมา', '25/1', 'ท่าอ่าง', 'โชคชัย', 'นครราชสีมา', 30190, 1733023, 0, 1013, 1733, 1700, 300703, 3007, 30, 103, 2561),
('61172310196-7', 'นางสาว', 'พลอยไพลิน', 'ศิลป์ศร', 'PLOYPAIRIN', 'SINSORN', 'พลอย', '130990247988-3', '7/31/2540', 'B', '062-9960117', 'เทคโนโลยีคอมพิวเตอร์', 'ปวส', '4', 'วิทยาลัยเทคโนโลยีช่างกลพาณิชยการนครราชสีมา', '131', 'ตลาด', 'เมือง', 'นครราชสีมา', 30310, 1733023, 0, 2238, 1733, 1700, 300122, 3000, 30, 103, 2561),
('61172310218-3', 'นาย', 'พชร', 'ปัตตานัง', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733023, 0, 0, 1733, 1700, 0, 0, 0, 103, 2561),
('61172310226-1', 'นาย', 'อัษฎาพงศ์', 'บุตรทะยัก', 'ATSADAPHONG', 'BUTTHAYAK', 'พี', '130990248870-1', '8/26/2540', 'O', '097-1716994', 'อิเล็กทรอนิกส์', 'ปวส', '3', 'วิทยาลัยเทคนิคนครราชสีมา', '597/4', 'เมือง', 'เมือง', 'นครราชสีมา', 30000, 1733023, 0, 1013, 1733, 1700, 300101, 3000, 30, 103, 2561),
('61172310227-1', 'นาย', 'ธนากร ', 'จีนวงศ์', 'TNANAKORN', 'JEENWONG', 'เอื้อ', '134990089750-7', '12/21/2540', 'O', '082-6488441', 'คอมพิวเตอร์ซอฟแวร์', 'ปวส', '3', 'วิทยาลัยเทคนิคอุบลราชธานี', '184', 'ยางลักกระโนหลุ่ม', 'ม่วงสามสิบ', 'อุบลราชธานี', 34140, 1733023, 0, 301, 1733, 1700, 341407, 3414, 34, 103, 2561),
('61172310238-9', 'นาย', 'วสุรัตน์', 'สิทธิสมบัติ', 'WASURAT', 'SITTISOMBAT', 'อ๊อด', '130990244479-8', '4/12/2540', 'B', '094-8267395', 'เทคโนโลยีสารสนเทศ', 'ปวส', '3', 'วิทยาลัยเทคนิคศรีสะเกษ', '90', 'หนองอึ่ง', 'ราษีไศล', 'ศรีสะเกษ', 33160, 1733023, 0, 712, 1733, 1700, 330909, 3309, 33, 103, 2561),
('61172310239-9', 'นาย', 'พงค์อำมาตย์', 'หอมหวาน', 'PONGAMMANT', 'HOMWAR', 'โบ๊ต', '130180119980-4', '8/28/2541', 'O', '094-3039852', 'อิเล็กทรอนิกส์', 'ปวส', '3', 'มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน', '227', 'คลองไผ่', 'สีคิ้ว', 'นครราชสีมา', 30340, 1733023, 0, 1013, 1733, 1700, 302010, 3020, 30, 103, 2561),
('61172310261-2', 'นาย', 'มานิตชัย', 'วังผือ', 'MANITCHAI', 'WANGPUE', 'มิกซ์', '145060022844-9', '10/12/2540', 'B', '098-1014996', 'เทคโนโลยีคอมพิวเตอร์', 'ปวส', '4', 'วิทยาลัยเทคนิคยโสธร', '47', 'โพธิ์ชัย', 'พนมไพร', 'ร้อยเอ็ด', 45140, 1733023, 0, 998, 1733, 1700, 350501, 3505, 35, 103, 2561),
('61172310276-0', 'นาย', 'เมธชาญ', 'นาลาด', 'METACHAN', 'NALAD', 'กี้', '130990250318-2', '9/29/2540', 'O', '090-3588691', 'เทคโนโลยีคอมพิวเตอร์', 'ปวส', '3', 'วิทยาลัยเทคนิคนครราชสีมา', '27', 'สาหร่าย', 'ชุมพวง', 'นครราชสีมา', 30270, 1733023, 0, 1013, 1733, 1700, 301704, 3017, 30, 103, 2561),
('61172310280-8', 'นางสาว', 'เบญจพร ', 'กิตติวิเชียรชัย', 'BENJAPORN', 'KITTIVICHAINCHAI', 'เบญ', '130990254034-7', '1/15/2541', 'O', '061-1457951', 'เทคโนโลยีคอมพิวเตอร์', 'ปวส', '3', 'มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน', '387', 'บ้านเกาะ', 'เมือง', 'นครราชสีมา', 30000, 1733023, 0, 0, 1733, 1700, 300112, 3000, 30, 103, 2561),
('61172310294-6', 'นาย', 'ธนวัฒน์', 'เดชคง', 'THANAWAT', 'DETKHONG', 'โอ๊ต', '1306070012738-6', '4/20/2541', 'O', '095-7846609', 'เทคโนโลยีคอมพิวเตอร์', 'ปวส', '4', 'วิทยาลัยเทคนิคนครราชสีมา', '119', 'บ้านขาม', 'จัตุรัส', 'ชัยภูมิ', 36130, 1733023, 0, 1013, 1733, 1700, 30804, 3006, 25, 103, 2561),
('61172310298-6', 'นาย', 'กฤษณะ', 'จันทรวิจิตร', 'KRITSANA', 'CHANTTHARAWICHIT', 'หนึ่ง', '134990089510-5', '12/1/2540', 'B', '083-7369804', 'คอมพิวเตอร์ฮาดแวร์', 'ปวส', '3', 'วิทยาลัยเทคนิคอุบลราชธานี', '65', 'เมือง', 'เมือง', 'อุบลราชธานี', 34000, 1733023, 0, 301, 1733, 1700, 340119, 3401, 34, 103, 2561),
('61172310304-4', 'นาย', 'สิรวิชญ์', 'ตังตา', 'SIRAWIT', 'TUNGTA', 'ตี๋', '', '1/1/2539', 'B', '087-9571319', 'เทคนิคคอมพิวเตอร์', 'ปวส', '3', 'วิทยาลัยเทคนิคนครราชสีมา', '126', 'สูงเนิน', 'สูงเนิน', 'นครราชสีมา', 30170, 1733023, 0, 1013, 1733, 1700, 301801, 3018, 30, 103, 2561),
('61172310319-2', 'นาย', 'พาทิศ', 'หลินหะตระกูล', 'PATHIT', 'LINHATRAKUL', 'เอ', '130990088640-8', '10/17/2540', 'O', '045-244920', 'คอมพิวเตอร์ฮาดแวร์', 'ปวส', '3', 'วิทยาลัยเทคนิคอุบลราชธานี', '25', 'เมือง', 'เมือง', 'อุบลราชธานี', 34000, 1733023, 0, 301, 1733, 1700, 340119, 3401, 34, 103, 2561),
('61172310321-0', 'นางสาว', 'วลิษา', 'โตดตามี', 'WALISA', 'TODTAMEE', 'กี้', '133090031048-6', '6/24/2541', 'B', '094-8267395', 'เทคโนโลยีสารสนเทศ', 'ปวส', '3', 'วิทยาลัยเทคนิคศรีสะเกษ', '90', 'หนองอึ่ง', 'ราษีไศล', 'ศรีสะเกษ', 33160, 1733023, 0, 712, 1733, 1700, 330909, 3309, 33, 103, 2561),
('61172310324-0', 'นาย', 'ชาญชัย ', 'ลอยสูงวงศ์', 'CHANCHAI', 'LOISUNGWONG', 'เบส', '130990124320-9', '2/6/2539', 'A', '065-3122519', 'เทคโนโลยีคอมพิวเตอร์', 'ปวส', '3', 'วิทยาลัยเทคนิคนครราชสีมา', '35/1', 'โคกไทย', 'ปักธงชัย', 'นครราชสีมา', 30150, 1733023, 0, 1013, 1733, 1700, 301403, 3014, 30, 103, 2561),
('61172310331-8', 'นาย', 'สถาพร', 'มณีบุญ', '', '', '', '', '', '', '', '', '0', '0', '', '', '', '', '', 0, 1733023, 0, 0, 1733, 1700, 0, 0, 0, 103, 2561),
('61172310346-6', 'นาย', 'นราวิชญ์', 'จันทร์หาญ', 'NARAWIT', 'JANHAN', 'นิว', '134140017193-3', '2/22/2540', 'B', '091-4676387', 'คอมพิวเตอร์ฮาดแวร์', 'ปวส', '3', 'วิทยาลัยเทคนิคอุบลราชธานี', '17', 'นาเล็ง', 'ม่วงสามสิบ', 'อุบลราชธานี', 34140, 1733023, 0, 301, 1733, 1700, 30702, 3079, 34, 103, 2561),
('61172310347-6', 'นาย', 'ภูริทัต', 'ปัญญาวัน', 'PHURITHAT', 'PANYAWAN', 'ก็อตจิ', '134150027978-7', '7/19/2540', 'B', '064-7744337', 'ไฟฟ้ากำลัง', 'ปวส', '3', 'วิทยาลัยเทคนิคกันทรลักญ์', '104/1', 'หนองหญ้าลาด', 'กันทรลักญ์', 'ศรีสะเกษ', 33110, 1733023, 0, 2121, 1733, 1700, 30059, 3701, 33, 103, 2561),
('61172310350-3', 'นาย', 'ณัฐพล', 'คงขุนทด', 'NATTHAPHON ', 'KHONGKHUNTHOD', 'โอเล่', '', '10/15/2540', 'B', '090-2914126', 'เทคนิคคอมพิวเตอร์', 'ปวส', '4', 'วิทยาลัยเทคนิคนครราชสีมา', '', 'มิตรภาพ', 'สีคิ้ว', 'นคราชสีมา', 30140, 1733023, 0, 1013, 1733, 1700, 300405, 3305, 30, 103, 2561),
('61172310424-9', 'นาย', 'อารันต์', 'ความสวัสดิ์', 'ARUN', 'KHWAMSAWAT', 'รันต์', '134990088519-3', '10/14/2540', 'AB', '086-8734420', 'เทคโนโลยีคอมพิวเตอร์', 'ปวส', '3', 'วิทยาลัยเทคนิคอุบลราชธานี', '91', 'กอบโรง', 'เมือง', 'อุบลราชธานี', 34000, 1733023, 0, 301, 1733, 1700, 300451, 3305, 34, 103, 2561);

-- --------------------------------------------------------

--
-- Table structure for table `studygroup`
--

CREATE TABLE `studygroup` (
  `Groupname` varchar(100) NOT NULL COMMENT 'ชื่อกลุ่มเรียน',
  `Groupcode` int(20) NOT NULL COMMENT 'รหัสกลุ่มเรียน',
  `Coursecode` int(20) NOT NULL COMMENT 'รหัสหลักสูตร'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `studygroup`
--

INSERT INTO `studygroup` (`Groupname`, `Groupcode`, `Coursecode`) VALUES
('CPE.59231', 59231, 1733023),
('CPE.59241', 59241, 1733022),
('CPE.60231', 60231, 1733023),
('CPE.60241', 60241, 1733022),
('CPE.61231', 61231, 1733023),
('CPE.61241', 61241, 1733022);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `advisors`
--
ALTER TABLE `advisors`
  ADD PRIMARY KEY (`Teachercode`);

--
-- Indexes for table `branch`
--
ALTER TABLE `branch`
  ADD PRIMARY KEY (`Branchcode`);

--
-- Indexes for table `course`
--
ALTER TABLE `course`
  ADD PRIMARY KEY (`Coursecode`);

--
-- Indexes for table `faculty`
--
ALTER TABLE `faculty`
  ADD PRIMARY KEY (`Facultycode`);

--
-- Indexes for table `student`
--
ALTER TABLE `student`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `studygroup`
--
ALTER TABLE `studygroup`
  ADD PRIMARY KEY (`Groupcode`);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
